research/logs/log-2021-02-22.org
#+TITLE: Log Week 4
#+OPTIONS: toc:nil

 This week I was quite busy with module work so sadly didn't finish all of what I had outlined in my previous log.

 I have mainly been working on my Implementation section of my report, I am starting by writing my approach to single-agent planning.

 I also had a look into using a Graphing library /((Light)Graphs.jl)/ to represent the whole road network as a graph of road structs, this proved awkward as the library does not allow for using custom objects as edges. I will therefore need to invest in my own structures and accompanying methods, though a conversion to their form may be useful for visualisation.
