research/logs/log-2021-02-22.tex
% Created 2021-03-01 Mon 10:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Sam Barrett}
\date{\today}
\title{Log Week 4}
\hypersetup{
 pdfauthor={Sam Barrett},
 pdftitle={Log Week 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
This week I was quite busy with module work so sadly didn't finish all of what I had outlined in my previous log.

I have mainly been working on my Implementation section of my report, I am starting by writing my approach to single-agent planning.

I also had a look into using a Graphing library \emph{((Light)Graphs.jl)} to represent the whole road network as a graph of road structs, this proved awkward as the library does not allow for using custom objects as edges. I will therefore need to invest in my own structures and accompanying methods, though a conversion to their form may be useful for visualisation.
\end{document}
